Revit 2027 API
BuiltInFailures.RegenFailures.GeomStepFailedError Property
 Can't rebuild geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GeomStepFailedError { get; }
Public Shared ReadOnly Property GeomStepFailedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GeomStepFailedError {
	FailureDefinitionId^ get ();
}
static member GeomStepFailedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace